app/controllers/video_games_controller.rb

  def index
    @video_games = VideoGame.all
---
SELECT "video_games".* FROM "video_games"

  def show
    video_game_id = params[:id]
    @video_game = VideoGame.find(video_game_id)
---
SELECT  "video_games".* FROM "video_games" WHERE "video_games"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    title = params[:video_game][:title]
    description = params[:video_game][:description]
    # analyses = params[:video_game][:analyses]
    device = params[:video_game][:device]
    editor = params[:video_game][:editor]

    video_game = VideoGame.create({title: title, description:description, device:device, editor:editor})
---
INSERT INTO "video_games" ("title", "description", "device", "editor", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)